Tekla.Structures.Internal.dotVector_t
Struct for Vector.

Tekla.Structures.Internal.dotVector_t.Direction
Vector data.

Tekla.Structures.Internal.dotVector_t.#ctor(Tekla.Structures.Geometry3d.Vector)
Construct point from point.
vector:

Tekla.Structures.Internal.dotVector_t.ToStruct(Tekla.Structures.Geometry3d.Vector)
Vector to dotVector_t.
vector:

Tekla.Structures.Internal.dotVector_t.FromStruct(Tekla.Structures.Geometry3d.Vector)
Vector from dotVector_t.
vector:

Tekla.Structures.Internal.dotVector_t.ToString
Returns the string presentation.
Returns: The string.

Tekla.Structures.Internal.dotVector_t.Equals(Tekla.Structures.Internal.dotVector_t)
Check equality.
point:
Returns:

Tekla.Structures.Internal.dotVector_t.Equals(System.Object)
Check equality.
obj:
Returns:

Tekla.Structures.Internal.dotVector_t.GetHashCode
Get the hashcode.
Returns: